Hdchipeo/posture-monitor/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Compiler Options
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power Management
# Disable tickless idle and sleep GPIO isolation in active wearable
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# HTTP Server & WebSocket Configuration
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_HTTPD_MAX_OPEN_SOCKETS=7
# Status LED Configuration
CONFIG_POSTURE_STATUS_LED_GPIO=5
CONFIG_POSTURE_STATUS_LED_ACTIVE_LEVEL=1

# Flash Size & OTA Partition Table
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
